-- database/students_db.sql

CREATE DATABASE students_db;

\c students_db;

CREATE TABLE students (
                          id SERIAL PRIMARY KEY,
                          surname VARCHAR(255) NOT NULL,
                          name VARCHAR(255) NOT NULL,
                          patronymic VARCHAR(255),
                          birth_date DATE NOT NULL,
                          record_book_number VARCHAR(20) UNIQUE NOT NULL
);

-- Додавання студентів
INSERT INTO students (surname, name, patronymic, birth_date, record_book_number) VALUES
                                                                                     ('Іванов', 'Іван', 'Петрович', '2001-01-15', 'AA123456'),
                                                                                     ('Петров', 'Петро', 'Іванович', '2002-02-20', 'BB789012'),
                                                                                     ('Сидоров', 'Сидір', 'Андрійович', '2001-03-25', 'CC345678'),
                                                                                     ('Коваленко', 'Олена', 'Миколаївна', '2002-04-30', 'DD901234'),
                                                                                     ('Шевченко', 'Андрій', 'Сергійович', '2001-05-10', 'EE567890'),
                                                                                     ('Бондаренко', 'Марія', 'Олексіївна', '2002-07-15', 'FF123456'),
                                                                                     ('Ткаченко', 'Олександр', 'Дмитрович', '2001-08-20', 'GG789012'),
                                                                                     ('Кравченко', 'Юлія', 'Іванівна', '2002-09-25', 'HH345678'),
                                                                                     ('Ковальчук', 'Віктор', 'Петрович', '2001-10-30', 'II901234'),
                                                                                     ('Волошин', 'Наталія', 'Андріївна', '2002-11-10', 'JJ567890'),
                                                                                     ('Захарчук', 'Роман', 'Сергійович', '2001-12-15', 'KK123456'),
                                                                                     ('Поліщук', 'Ірина', 'Олексіївна', '2002-01-20', 'LL789012'),
                                                                                     ('Демченко', 'Олег', 'Дмитрович', '2001-02-25', 'MM345678'),
                                                                                     ('Савчук', 'Людмила', 'Іванівна', '2002-03-30', 'NN901234'),
                                                                                     ('Петров', 'Артем', 'Петрович', '2001-04-10', 'OO567890'),
                                                                                     ('Козак', 'Валентина', 'Андріївна', '2002-05-15', 'PP123456'),
                                                                                     ('Лисенко', 'Ігор', 'Сергійович', '2001-07-20', 'QQ789012'),
                                                                                     ('Мельник', 'Ольга', 'Олексіївна', '2002-08-25', 'RR345678'),
                                                                                     ('Павленко', 'Максим', 'Дмитрович', '2001-09-30', 'SS901234'),
                                                                                     ('Руденко', 'Тетяна', 'Іванівна', '2002-10-10', 'TT567890');